In [44]:
# Step1: Import Python libraries
import pandas as pd
import seaborn as sns
import numpy as np

In [9]:
# Step2: read Dataset
df = pd.read_csv('./local_data/titanic.csv')
print('done')

done

In [10]:
# What is the shape and look of my dataset
df.shape

(891, 12)

In [12]:
# What does it look like?
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [13]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [14]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [17]:
int_cols = df.select_dtypes(include='int64').columns
print(int_cols)

Index(['PassengerId', 'Survived', 'Pclass', 'SibSp', 'Parch'], dtype='object')

In [18]:
int_cols = df.select_dtypes(include='float64').columns
print(int_cols)

Index(['Age', 'Fare'], dtype='object')

In [19]:
int_cols = df.select_dtypes(include='object').columns
print(int_cols)

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [27]:
#find duplicate rows if any
duplicates = df.duplicated()
print(duplicates) #too many records to identify duplicates
df[df.duplicated(keep=False)] #let's only keep the dup values in separate df

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [30]:
#identifying rows with missing values
rows_with_missing_values = df[df.isna().any(axis=1)]
print(rows_with_missing_values)
print(rows_with_missing_values.shape) # we can't delete 708 records though.....what do we do.

     PassengerId  Survived  Pclass                                      Name  \
0              1         0       3                   Braund, Mr. Owen Harris
2              3         1       3                    Heikkinen, Miss. Laina
4              5         0       3                  Allen, Mr. William Henry
5              6         0       3                          Moran, Mr. James
7              8         0       3            Palsson, Master. Gosta Leonard
..           ...       ...     ...                                       ...
884          885         0       3                    Sutehall, Mr. Henry Jr
885          886         0       3      Rice, Mrs. William (Margaret Norton)
886          887         0       2                     Montvila, Rev. Juozas
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0      male  22.0      1      0         A/5 21171   7.2500   NaN        S
2    female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S
4      male  35.0      0      0            373450   8.0500   NaN        S
5      male   NaN      0      0            330877   8.4583   NaN        Q
7      male   2.0      3      1            349909  21.0750   NaN        S
..      ...   ...    ...    ...               ...      ...   ...      ...
884    male  25.0      0      0   SOTON/OQ 392076   7.0500   NaN        S
885  female  39.0      0      5            382652  29.1250   NaN        Q
886    male  27.0      0      0            211536  13.0000   NaN        S
888  female   NaN      1      2        W./C. 6607  23.4500   NaN        S
890    male  32.0      0      0            370376   7.7500   NaN        Q

[708 rows x 12 columns]
(708, 12)

In [40]:
null_vals = df.isnull().sum()
print(null_vals)
counts_cabin = df['Cabin'].value_counts()
print(counts_cabin)

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64
Cabin
B96 B98        4
G6             4
C23 C25 C27    4
C22 C26        3
F33            3
              ..
E34            1
C7             1
C54            1
E36            1
C148           1
Name: count, Length: 147, dtype: int64

In [42]:
#let's drop the problematic column
df.drop('Cabin', axis=1, inplace=True)

In [43]:
df.dtypes #verify Cabin is gone

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Embarked        object
dtype: object

In [46]:
print(all(np.where(df['PassengerId'] > 0, True, False))) # are all records in PassId integers?
is_string_column = df['Name'].apply(lambda x: isinstance(x, str)).all() #check all rows are strings in column
print(is_string_column)

True
True

In [49]:
#checking floats... let's get a bit more efficient
def check_all_floats(df, column_name):
    ''' Checks if all values in a column are floats.'''
    return df[column_name].apply(lambda x: isinstance(x, float)).all()

print(check_all_floats(df, 'Age')) #check age
print(check_all_floats(df, 'Fare')) #check Fare

True
True

In [52]:
#let's get even fancier
integer_cols_list = df.select_dtypes(include='float64').columns
print(type(int_cols))

int_list = []
int_list.append(integer_cols_list)
print(type(int_list))

for i int_list:

<class 'pandas.core.indexes.base.Index'>
<class 'list'>